In [7]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

from numpy.random import randn

In [9]:
serr = Series([1,2,3,4],index = ['A','B','C','D'])
serr

A    1
B    2
C    3
D    4
dtype: int64

In [10]:
serr.reindex(['A','B','C','D','E','F']) #change indexes, columns

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [11]:
serr.reindex(['A','B','C','D','E','F'],fill_value=0) #reindex and fill empty values

A    1
B    2
C    3
D    4
E    0
F    0
dtype: int64

In [13]:
ranger = range(15)
ranger

range(0, 15)

In [15]:
countries = Series(['usa','uk','france'],index = [0,4,7])
countries

0       usa
4        uk
7    france
dtype: object

In [16]:
countries.reindex(ranger,method='ffill') # ffill: propagate last valid observation forward to next valid

0        usa
1        usa
2        usa
3        usa
4         uk
5         uk
6         uk
7     france
8     france
9     france
10    france
11    france
12    france
13    france
14    france
dtype: object

In [18]:
data = DataFrame(randn(25).reshape((5,5)),index = ['A','B','D','E','F'],columns = ['col1','clo2','clo3','col4','col5'])
data #syntax of a data frame :

       col1      clo2      clo3      col4      col5
A -0.214682 -0.309762 -1.073830  0.524947 -0.581517
B  0.642531  1.771520 -0.520851  0.257056  0.529168
D  0.457527  1.463229  0.788765 -2.131944 -0.559017
E -1.754374  0.497385  0.350674 -0.390747 -0.117156
F  1.007371  1.869126 -1.289354  0.412952  0.368275

In [21]:
data2 = data.reindex(index=['A','B','C','D','E','F'])
data2

       col1      clo2      clo3      col4      col5
A -0.214682 -0.309762 -1.073830  0.524947 -0.581517
B  0.642531  1.771520 -0.520851  0.257056  0.529168
C       NaN       NaN       NaN       NaN       NaN
D  0.457527  1.463229  0.788765 -2.131944 -0.559017
E -1.754374  0.497385  0.350674 -0.390747 -0.117156
F  1.007371  1.869126 -1.289354  0.412952  0.368275

In [22]:
data2 = data.reindex(columns=['col1','clo2','clo3','col4','col5','col6'])

In [23]:
data2

       col1      clo2      clo3      col4      col5  col6
A -0.214682 -0.309762 -1.073830  0.524947 -0.581517   NaN
B  0.642531  1.771520 -0.520851  0.257056  0.529168   NaN
D  0.457527  1.463229  0.788765 -2.131944 -0.559017   NaN
E -1.754374  0.497385  0.350674 -0.390747 -0.117156   NaN
F  1.007371  1.869126 -1.289354  0.412952  0.368275   NaN

In [24]:
data2 = data.reindex(index = ['A','B','C','D','E','F','G'] ,columns=['col1','clo2','clo3','col4','col5','col6','col7']) #all in one
data2

       col1      clo2      clo3      col4      col5  col6  col7
A -0.214682 -0.309762 -1.073830  0.524947 -0.581517   NaN   NaN
B  0.642531  1.771520 -0.520851  0.257056  0.529168   NaN   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN   NaN
D  0.457527  1.463229  0.788765 -2.131944 -0.559017   NaN   NaN
E -1.754374  0.497385  0.350674 -0.390747 -0.117156   NaN   NaN
F  1.007371  1.869126 -1.289354  0.412952  0.368275   NaN   NaN
G       NaN       NaN       NaN       NaN       NaN   NaN   NaN